<?php
    /*
    ЗАДАНИЕ 1
    - Вызовите метод getAll,
    - Результат вызова метода getAll сохраните в переменной.
    - Получите количество записей в Гостевой книге и выведите его в браузер в произвольной форме
    - Используя цикл, выведите в браузер все сообщения, а также информацию
      об авторе каждого сообщения в произвольной форме
    - После каждого сообщения сформируйте ссылку для удаления этой
      записи. Информацию об идентификаторе удаляемого сообщения передавайте методом GET.
    */

    /* ЗАДАНИЕ 2
    - После вызова метода getAll проверьте, был ли запрос успешным?
    - Если НЕТ, то присвойте переменной $errMsg строковое значение "Произошла ошибка при выводе записей"
    */
?>