<?php
/**
 * Created by PhpStorm.
 * User: multi
 * Date: 02.12.2015
 * Time: 21:44
 */

$categories
    = array(
    'Новинки, Распродажа, Акция' => array(
        'НовыеТовары',
        'АРаспродажа',
        'Акция'
    ),

    'Детская мебель и транспорт' => array(
        'Автокресла, коляски, манежи',
        'Велосипеды 2-х колесные',
        'Велосипеды 3-х колесные',
        'Горки, домики, игровые центры',
        'Парты, столики, мягкая мебел',
        'Самокаты',
        'Санки, снегокаты',
        'Стулчики для кормления, ходунки',
        'Текстил',
        'Толокары',
        'Электромобили и карты'
    ),

    'Игровые наборы товары для праздника' => array(
        'Все для праздника',
        'Животные, фигурки',
        'Игры разные',
        'Лото, домино, шахматы',
        'Музыкалные инструменты',
        'Наборы фигурок',
        'Сувениры, часики, брелки',
        'Сумочки, рюкзачки'
    ),

    'Игрушка Украина' => array(
        'ВладиТойc',
        'Данко Тойс',
        'Киндер Вей',
        'Колор Пласт',
        'Макс Групп',
        'Орион',
        'Ранок Креатив',
        'Технокомп',
        'Юника'
    ),

    'Игрушки для девочек' => array(
        'Бытовая техника, кухни и аксессуары',
        'Доктор, косметика, бисер, бижутерия',
        'Домики, замки, мебел для кукол',
        'Кареты, лошади, пони',
        'Коляски, кроватки',
        'Куклы интерактивные, функционалные',
        'Куклы, пупсы, фигурки'
    ),

    'Игрушки для мальчиков' => array(
        'Авто-мото-жд техника, авиация',
        'Билярд, футбол, хоккей',
        'Гаражи, треки, жд, аэропорты',
        'Металлические модели',
        'Наборы игровые',
        'Оружие',
        'Роботы, трансформеры',
        'Транспорт радиоуправляемый'
    ),

    'Конструкторы' => array(
        'Конструкторы для малышей',
        'Конструкторы металлические',
        'Конструкторы пластиковые'
    ),

    'Логические и развивающие игры' => array(
        'Деревянные игры',
        'Досточки для рисования, молберты',
        'Логика, сортеры, головоломки',
        'Мозаика, пазлы',
        'Наборы для творчества',
        'Наборы экспериментов, электронные игры',
        'Обучающие игрушки',
        'Повторюшки, интерактивные игрушки'
    ),

    'Мягкая игрушка' => array(
        'Мягкая игрушка'
    ),

    'Надувные изделия' => array(
        'Бассейны и аксессуары',
        'Игровые центры, батуты',
        'Круги, нарукавники, плотики, жилеты, мячи',
        'Матрасы и мебел',
        'Насосы, лодки, аксессуары для плавания'
    ),

    'Печатная продукция' => array(
        'Книги развивающие, учебные'
    ),

    'Сезонные товары' => array(
        'Водяное оружие, насосы',
        'Воздушные змеи, ветрячки, шарики',
        'Зонтики, дождевики',
        'Игрушки с мылными пузырями',
        'Катера',
        'Наборы для песочницы',
        'Палатки'
    ),

    'Спортивные товары' => array(
        'Бадминтон, теннис, дартс, баскетбол',
        'Боксерские наборы',
        'Мячи, попрыгунчики',
        'Ролики, скейты, конки',
        'Тренажеры, батуты, фитнес'
    ),

    'Товары для малышей' => array(
        'Заводные игрушки, рыбалка',
        'Игрушки для купания',
        'Игрушки музыкалные',
        'Карусели, проекторы, светилники',
        'Каталки, качалки',
        'Коврики, корзины для игрушек',
        'Кубики, пирамидки, погремушки, калейдоскопы',
        'Неваляшки, молоточки, юлы, рули',
        'Телефоны, рации, фотоаппараты, микрофоны',
        'Товары для детской безопасности',
        'Товары для кормления, аксессуары для младенцев'
    ),

    'Товары для школы, канцтовары' => array(
        'Бумага и изделия из бумаги',
        'Делопроизводство',
        'Канцтовары офисные',
        'Канцтовары школные',
        'Принадлежности для писма',
        'Рюкзаки, сумки, пеналы',
        'Скотч, клей'
    )
);

$parts = count($categories);