<?php
    /*
    ЗАДАНИЕ 1
    - Запустите сессию
    - Создайте переменную nChars(количество выводимых на картинке символов)
        и присвойте ей произвольное значение(рекомендуемое: 5)
    - Сгенерируйте случайную строку длиной nChars символов
    - Создайте сессионную переменную randStr и присвойте ей сгенерированную строку
    */

    /*
    ЗАДАНИЕ 2
    - Создайте изображение на основе файла "images/noise.jpg"
    - Создайте цвет для рисования
    - Включите сглаживание
    - Задайте начальные координаты x и y для отрисовки строки(рекомендуемые: 20 и 30)
    - Используя цикл for отрисуйте строку посимвольно
    - Для каждого символа используйте случайные значение размера и угла наклона
    - Отдайте полученный результат как jpeg-изображение с 10% сжатием
    */

?>
