<?php
    /*
    ЗАДАНИЕ 1
    - Создайте объект DOM
    - Загрузите XML-документ в объект
    - Получите корневой элемент
    */
?>
<html>
<head>
    <title>Каталог</title>
</head>
<body>
<h1>Каталог книг</h1>
<table border="1" width="100%">
    <tr>
        <th>Автор</th>
        <th>Название</th>
        <th>Год издания</th>
        <th>Цена, руб</th>
    </tr>
    <?php
        /*
        ЗАДАНИЕ 2
        - Заполните таблицу необходимыми данными
        */
    ?>
</table>
</body>
</html>





