<?php
    /*
    ЗАДАНИЕ 1
    - Опишите функцию-обработчик начальных тегов
    - Опишите функцию-обработчик закрывающих тегов
    - Опишите функцию-обработчик текстового содержимого
    - Создайте парсер
    - Зарегистрируйте функцию-обработчики начальных и конечных тегов
    - Зарегистрируйте функцию-обработчик текстового содержимого
    */
?>
<html>
<head>
    <title>Каталог</title>
</head>
<body>
<h1>Каталог книг</h1>
<table border="1" width="100%">
    <tr>
        <th>Автор</th>
        <th>Название</th>
        <th>Год издания</th>
        <th>Цена, руб</th>
    </tr>
    <?php
        /*
        ЗАДАНИЕ 2
        - Запустите парсер
        */
    ?>
</table>
</body>
</html>